Codes/Neural Networks PyTorch/Further Steps/PINNs/PGML main/PGML main/PGML-BL/OpenFoam_Laminar/laminarFlatPlate/Different_Reynolds_Number/mesh_trial/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       42870;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       43110;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       43200;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       43290;
    }
    symmBound
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       43490;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          43200;
        startFace       43530;
    }
)

// ************************************************************************* //
